ews-api/src/test/resources/requests/request_cxf_success.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
	xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
	<soap:Header>
		<t:RequestServerVersion Version="Exchange2007_SP1"></t:RequestServerVersion>
	</soap:Header>
	<soap:Body>
		<m:FindItem Traversal="Shallow">
			<m:ItemShape>
				<t:BaseShape>AllProperties</t:BaseShape>
			</m:ItemShape>
			<m:IndexedPageItemView MaxEntriesReturned="50"
				Offset="0" BasePoint="Beginning"></m:IndexedPageItemView>
			<m:ParentFolderIds>
				<t:DistinguishedFolderId Id="inbox"></t:DistinguishedFolderId>
			</m:ParentFolderIds>
		</m:FindItem>
	</soap:Body>
</soap:Envelope>